### Pandas GroupBy Function in Python
<b>Pandas GroupBy function is used to split the data into groups based on some criteria.
Any GroupBy operation involves one of the following operations on the original object:
-Splitting the object
-Applying a function
-Combining the result</b>

**Syntax:** ***DataFrame.groupby()***

In [7]:
import pandas as pd

# Correct code using raw string
df = pd.read_csv(r'C:\Users\DELL XPS\Desktop\AI & ML\Data\student_result1.csv')
# Display the dataframe (optional)
print(df)

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [8]:
gr1 = df.groupby(by = 'Section')
gr1

In [11]:
gr1.groups

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [14]:
df.groupby(['Section', 'Class']).groups # groupby by list

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3], ('C', 12): [4]}

In [16]:
for Class, df_1 in gr1:
    print(Class)
    print(df_1)

A
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
B
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [18]:
list(gr1)              # convert to list

[('A',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  0        1001       A     10          2                       3          50
  2        1003       A     10          3                       2          60),
 ('B',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  1        1002       B     10          6                       2          80),
 ('C',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  3        1004       C     11          0                       1          45
  4        1005       C     12          5                       2          75)]

In [22]:
dict(list(gr1))        # convert to dict

{'A':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 0        1001       A     10          2                       3          50
 2        1003       A     10          3                       2          60,
 'B':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 1        1002       B     10          6                       2          80,
 'C':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 3        1004       C     11          0                       1          45
 4        1005       C     12          5                       2          75}

In [23]:
#Selecting a group
 
# A single group can be selected using get_group():
 
gr3 = df.groupby('Class').get_group(10)
gr3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [26]:
gr3 = df.groupby('Section').get_group('A')
gr3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

In [34]:
gr1.sum()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A              2004     20          5                       5         110
B              1002     10          6                       2          80
C              2009     23          5                       3         120

In [44]:
gr1.max()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A              1003     10          3                       3          60
B              1002     10          6                       2          80
C              1005     12          5                       2          75

In [35]:
gr1.mean()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A            1002.0   10.0        2.5                     2.5        55.0
B            1002.0   10.0        6.0                     2.0        80.0
C            1004.5   11.5        2.5                     1.5        60.0

In [36]:
gr1.describe()

        Student ID                                                      \
             count    mean       std     min      25%     50%      75%
Section
A              2.0  1002.0  1.414214  1001.0  1001.50  1002.0  1002.50
B              1.0  1002.0       NaN  1002.0  1002.00  1002.0  1002.00
C              2.0  1004.5  0.707107  1004.0  1004.25  1004.5  1004.75

                Class        ... Social Media usage hrs      Percentage        \
            max count  mean  ...                    75%  max      count  mean
Section                      ...
A        1003.0   2.0  10.0  ...                   2.75  3.0        2.0  55.0
B        1002.0   1.0  10.0  ...                   2.00  2.0        1.0  80.0
C        1005.0   2.0  11.5  ...                   1.75  2.0        2.0  60.0


               std   min   25%   50%   75%   max
Section
A         7.071068  50.0  52.5  55.0  57.5  60.0
B              NaN  80.0  80.0  80.0  80.0  80.0
C        21.213203  45.0  52.5  60.0  67.5  75.0

[3 rows x 40 columns]

In [45]:
gr1.agg(['sum', 'max', 'mean'])

TypeError: 'list' object is not callable

## What is Pandas merge Function?

#### Pandas merge connects columns or indexes in DataFrame based on one or more keys.

In [46]:
import pandas as pd

In [49]:
df1 = pd.DataFrame({'ID': [1,2,3,4],
                    'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [50]:
df2 = pd.DataFrame({'ID': [1,2,3,4],
                    'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

#### DataFrame Parameter   left, right, how , on, merge_type, suffixes

In [54]:
pd.merge(df1,df2, on = 'ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [55]:
pd.merge(df1,df2, on = 'ID', how = 'inner')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [56]:
pd.merge(df1,df2, on = 'ID', how = 'left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [57]:
pd.merge(df1,df2, on = 'ID', how = 'right')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [58]:
pd.merge(df1,df2, on = 'ID', how = 'outer')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [59]:
pd.merge(df1,df2, on = 'ID', how = 'outer', indicator = True)

   ID  Class Name _merge
0   1      9    A   both
1   2     10    B   both
2   3     11    C   both
3   4     12    D   both

In [60]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [61]:
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [63]:
df2 = pd.DataFrame({'ID': [5,6,7,8],
                    'Name':['A','B','C','D']})
df2

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [64]:
pd.merge(df1,df2, left_index = True, right_index = True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [67]:
pd.merge(df1,df2, on ='ID', suffixes = ('_Higher', '_Middle'))

Empty DataFrame
Columns: [ID, Class, Name]
Index: []

In [68]:
df1 = pd.DataFrame({'ID': [1,2,3,4],
                    'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [69]:
df2 = pd.DataFrame({'ID': [1,2,3,4],
                    'Class':[9,10,11,12]})
df2

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [70]:
pd.merge(df1,df2, on ='ID')   # For same type of indexes

   ID  Class_x  Class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

In [71]:
pd.merge(df1,df2, on ='ID', suffixes = ('_Higher', '_Middle'))

   ID  Class_Higher  Class_Middle
0   1             9             9
1   2            10            10
2   3            11            11
3   4            12            12